Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадииДоставкиЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПодборКурьераКЗаказу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПодборКурьераКЗаказу</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветКурьера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПодбораКурьераКЗаказу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтапПодбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыПодбораКурьеров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыПодбораКурьераКЗаказу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыПодбораКурьераКЗаказу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БеруВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеБеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетОтвета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтадииДоставкиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтадииДоставкиЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодборКурьера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задерживается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Заказ/Forms/КурьерскаяФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НеБеру(Команда)
	ОтклонитьНаСервере();    
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОтклонитьНаСервере()
	МенеджерЗаписи = РегистрыСведений.ПодборКурьераКЗаказу.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Заказ = Объект.Ссылка;
	МенеджерЗаписи.Курьер = МенеджерКурьеров.ПолучитьКурьера();
	МенеджерЗаписи.ОтветКурьера = Перечисления.СтатусыПодбораКурьераКЗаказу.НеБеру;
	МенеджерЗаписи.Записать(); 	
КонецПроцедуры


&НаКлиенте
Процедура БеруВРаботу(Команда)
	ПринятьНаСервере(); 
	Закрыть();
КонецПроцедуры    

&НаСервере
Процедура ПринятьНаСервере()   
	Курьер = МенеджерКурьеров.ПолучитьКурьера();
	МенеджерЗаписи = РегистрыСведений.ПодборКурьераКЗаказу.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Заказ = Объект.Ссылка;
	МенеджерЗаписи.Курьер = Курьер;
	МенеджерЗаписи.ОтветКурьера = Перечисления.СтатусыПодбораКурьераКЗаказу.БеруВРаботу;
	МенеджерЗаписи.Записать(); 	
	Объект.Курьер = Курьер; 
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Начат;
	ЭтаФорма.Записать();
КонецПроцедуры


&НаКлиенте
Процедура ОтменитьДоставку(Команда)
	ОтменитьЗаказНаСервере();	
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ПодтвердитьДоставку(Команда)
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Начат") ИЛИ
		Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Задерживается") Тогда
		ЗабратьЗаказИзМагазинаНаСервере(); 	
		Иначе Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Доставляется") Тогда
			ДоставитьЗаказНаСервере();	
		КонецЕсли;
	КонецЕсли;
	Закрыть();
КонецПроцедуры   


&НаСервере
Процедура ДоставитьЗаказНаСервере()   
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Доставлен;
	ЭтаФорма.Записать();
КонецПроцедуры  

&НаСервере
Процедура ЗабратьЗаказИзМагазинаНаСервере()   
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Доставляется;
	ЭтаФорма.Записать();
КонецПроцедуры

&НаСервере
Процедура ОтменитьЗаказНаСервере()   
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Отменен;
	ЭтаФорма.Записать();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтотЗаказВзят = ЭтотЗаказВзятКурьером();
	ЭтотЗаказЗавершен = ЭтотЗаказЗавершенКурьером();
	ЭтаФорма.Элементы.ГруппаКнопокДоставка.Видимость = ЭтотЗаказВзят И НЕ ЭтотЗаказЗавершен;
	ЭтаФорма.Элементы.ГруппаКнопокЗаявка.Видимость = НЕ ЭтотЗаказВзят;
	Если ЭтотЗаказНужноЗабратьИзМагазина() Тогда
		ЭтаФорма.Элементы.ПодтвердитьДоставку.Заголовок = "Забрал из магазина";			
	КонецЕсли;   
	Если ЭтотЗаказНужноДоставитьКлиенту() Тогда
		ЭтаФорма.Элементы.ПодтвердитьДоставку.Заголовок = "Доставил клиенту";		
	КонецЕсли;		        
КонецПроцедуры 

&НаКлиенте
Функция ЭтотЗаказВзятКурьером()
	Возврат НЕ Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.ПодборКурьера");
КонецФункции    

&НаКлиенте
Функция ЭтотЗаказЗавершенКурьером()
 	Возврат Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Доставлен") 
		ИЛИ Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Отменен");	
КонецФункции

&НаКлиенте
Функция ЭтотЗаказНужноЗабратьИзМагазина()
	Возврат Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Начат") ИЛИ
		Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Задерживается"); 	
КонецФункции

&НаКлиенте
Функция ЭтотЗаказНужноДоставитьКлиенту()
	Возврат Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Доставляется");
КонецФункции
